# Wire Size Class

Source: https://www.revitapidocs.com/2026/e4a5cfed-7952-4622-5fca-b556703e36b6.htm

---

| Wire Size Class |
| --- |

**Note: This API is now obsolete.**

Represents specific electrical wire size information. Inheritance Hierarchy System Object
Autodesk.Revit.DB APIObject
Autodesk.Revit.DB.Electrical WireSize

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")]
public class WireSize : APIObject
```

```
<ObsoleteAttribute("WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")>
Public Class WireSize
	Inherits APIObject
```

```
[ObsoleteAttribute(L"WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")]
public ref class WireSize : public APIObject
```

```
[<ObsoleteAttribute("WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")>]
type WireSize =
    class
        inherit APIObject
    end
```
The WireSize type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Ampacity | Get ampacity which be used for specifying size, the unit is ampere. |
|  | Diameter | Get diameter of wire. |
|  | InUse | Get or set whether the size can be used in sizing. |
|  | IsReadOnly | Identifies if the object is read\-only or modifiable. (Inherited from APIObject ) |
|  | Size | Get size symbol of wire. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject ) |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top Remarks Wire size is defined based on corresponding wire material type and temperature rating type. See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace